package com.xfn.dbLog.enums;


/**
 * Created by po on 16/5/30.
 */
public enum ReturnEnum {

    //成功
    SUCCESS(0, "成功"),

    //系统状态code信息1-100
    CODE_00001(1, "系统繁忙"),
    CODE_00002(2, "错误代码不存在"),
    CODE_00003(3, "系统很忙"),
    CODE_00004(4, "线程中断异常错误"),
    CODE_00005(5, "执行异常错误"),
    CODE_00006(6, "Redis 失败"),
    CODE_00007(7, "时间参数错误"),
    CODE_00008(8, "系统真的很忙,请稍后再试!"),
    CODE_00009(9, "请求不合法，请通过官方发送请求！"),

    //用户类错误信息100**
    CODE_10000(10000, "用户操作失败"),
    CODE_10001(10001, "用户不存在"),
    CODE_10002(10002, "登陆信息过期，请刷新页面或重新登入"),
    CODE_10003(10003, "修改默认帐套失败"),
    CODE_10004(10004, "用户与帐套信息不合法"),
    CODE_10005(10005, "获取钉钉用户信息失败，请稍后再试"),
    CODE_10006(10006, "获取钉钉企业信息失败，请稍后再试"),
    CODE_10007(10007, "钉钉路由错误，请稍后再试"),
    CODE_10008(10008, "钉钉配置错误，请稍后再试"),
    CODE_10009(10009, "公司不存在，请通过合法渠道请求"),

    CODE_11099(11099, ""),//特殊处理用于新建账套时拥有账套超过套餐内允许账套数


    //科目类错误信息110**
    CODE_11000(11000, "科目操作失败"),
    CODE_11001(11001, "科目不存在"),
    CODE_11002(11002, "科目已被凭证使用"),
    CODE_11003(11003, "拥有下级科目"),
    CODE_11004(11004, "修改科目失败"),
    CODE_11005(11005, "删除科目失败"),
    CODE_11006(11006, "科目已存在"),
    CODE_11007(11007, "仅修改科目名称失败"),
    CODE_11008(11008, "已有辅助核算关联"),
    CODE_11009(11009, "已设置期初值"),
    CODE_11010(11010, "分录异常"),
    CODE_11011(11011, "借贷不平衡"),
    CODE_11012(11012, "科目已被卡片使用"),
    CODE_11013(11013, "试算不平衡"),
    CODE_11014(11014, "恭喜您,您录入的初始余额平衡"),
    CODE_11015(11015, "缺少结账关键科目"),
    CODE_11016(11016, "此科目,无需使用反悔模式!"),
    CODE_11017(11017, "科目不存在或不是末端科目"),
    CODE_11018(11018, "期初值数据异常!"),
    CODE_11019(11019, "此科目,不允许使用反悔模式!"),
    CODE_11020(11020, "此科目,需遵循小企业会计准则"),
    CODE_11021(11021, "此科目为结帐必须科目,不允许修改"),
    CODE_11022(11022, "科目已被固定资产分类使用"),
    CODE_11023(11023, "本位币,不允许新增,修改或删除"),
    CODE_11024(11024, "外币已存在"),
    CODE_11025(11025, "外币已在凭证中使用"),
    CODE_11026(11026, "科目ID不允许00结尾"),

    //辅助核算类错误信息120**
    CODE_12000(12000, "辅助核算操作失败"),
    CODE_12001(12001, "该辅助核算已存在"),
    CODE_12002(12002, "该辅助核算已被凭证使用"),
    CODE_12003(12003, "取消该辅助核算关联失败"),
    CODE_12004(12004, "创建该辅助核算关联失败"),
    CODE_12005(12005, "删除该辅助核算失败"),
    CODE_12006(12006, "删除该辅助核算,需先取消科目关联"),
    CODE_12007(12007, "该辅助核算不存在"),
    CODE_12008(12008, "该辅助核算已被卡片使用"),
    CODE_12009(12009, "该辅助核算已被期初值使用"),

    //帐套类错误信息130**
    CODE_13000(13000, "帐套操作失败"),
    CODE_13001(13001, "创建帐套失败"),
    CODE_13002(13002, "修改帐套失败"),
    CODE_13003(13003, "删除帐套关联失败"),
    CODE_13004(13004, "删除帐套失败"),
    CODE_13005(13005, "模版有误"),
    CODE_13006(13006, "获取结账凭证信息有误"),
    CODE_13007(13007, "帐套已存在"),
    CODE_13008(13008, "不允许修改起始帐期"),
    CODE_13009(13009, "删除帐套传入信息有误"),
    CODE_13010(13010, "时间不在起始帐期内"),
    CODE_13011(13011, "当前帐期无凭证"),
    CODE_13012(13012, "账套名称已存在，请更换后重试"),
    CODE_13013(13013, "账套未找到，请刷新后重试"),

    //分录类错误信息140**
    CODE_14000(14000, "分录操作失败"),
    CODE_14001(14001, "插入分录失败"),
    CODE_14002(14002, "插入分录辅助核算关联失败"),
    CODE_14003(14003, "删除分录数据失败"),
    CODE_14004(14004, "分录中辅助核算未出现"),


    //凭证错误信息150**
    CODE_15000(15000, "凭证操作失败"),
    CODE_15001(15001, "插入凭证失败"),
    CODE_15002(15002, "凭证已经存在"),
    CODE_15003(15003, "凭证格式错误"),
    CODE_15004(15004, "科目辅助核算关联错误"),
    CODE_15005(15005, "凭证内分录数目异常"),
    CODE_15006(15006, "删除凭证失败"),
    CODE_15007(15007, "获取单张凭证失败"),
    CODE_15008(15008, "未能找到该凭证"),
    CODE_15009(15009, "插入的科目不存在"),
    CODE_15010(15010, "该月凭证已结账不允许修改"),
    CODE_15011(15011, "该月凭证已结账不允许整理"),
    CODE_15012(15012, "该凭证已审核"),
    CODE_15013(15013, "该草稿已存在"),
    CODE_15014(15014, "草稿已锁定"),
    CODE_15015(15015, "草稿不存在"),

    //三张表(科目余额表,利润表,资产表错误信息)160**
    CODE_16000(16000, "科目余额操作失败"),
    CODE_16001(16001, "初始化科目余额失败"),
    CODE_16002(16002, "初始化科目辅助核算余额失败"),
    CODE_16003(16003, "更新科目余额失败"),
    CODE_16004(16004, "查询科目余额的年月不在帐期内"),
    CODE_16005(16005, "查询科目余额的年月与数据发生异常"),
    CODE_16006(16006, "该帐套已经结过账,无法设置期初值"),
    CODE_16007(16007, "拥有相同的期初值设置"),
    CODE_16008(16008, "科目余额表与明细表数据不匹配"),
    CODE_16009(16009, "当前帐套无有效帐期"),
    CODE_16010(16010, "该帐套的起始帐期为1月，利润表无需设置期初值"),
    CODE_16011(16011, "初始化现金流量表失败"),

    CODE_16100(16100, "资产负债表操作失败"),
    CODE_16012(16012, "该帐套的起始帐期为1月，资产负债表无需设置年初余额"),
    CODE_16013(16013, "该数据不能为空"),

    //固定资产模块
    CODE_16200(16200, "流水号异常"),
    CODE_16301(16301, "卡片未找到"),
    CODE_16302(16302, "卡片未删除成功"),
    CODE_16303(16303, "卡片未修改成功"),
    CODE_16304(16304, "卡片编码已存在"),
    CODE_16305(16305, "分类操作提示"),
    CODE_16306(16306, "资产类别编码重复"),

    //导入模版错误
    CODE_16800(16800, "导入失败"),
    CODE_16801(16801, "excel列名与模版不符"),
    CODE_16802(16802, "excel数据不符"),
    CODE_16803(16803, "表格数据异常"),
    CODE_16804(16804, "导出失败"),
    CODE_16805(16805, "导入文件失败，请选择97或者97之后的execl版本进行导入"),
    CODE_16806(16806, "导入文件失败，请稍后再试"),
    CODE_16807(16807, "导入数据不符"),
    CODE_16808(16808, "导入数据异常"),
    CODE_16809(16809, "导入数据为空"),
    CODE_16810(16810, "导出PDF异常"),
    CODE_16811(16811, "导出PDF凭证列表不允许为空"),
    CODE_16812(16812, "导出PDF凭证列表不允许超过十张凭证"),

    CODE_16820(16820, "导出文件异常"),
    CODE_16830(16830, "发送文件正忙，请稍后再试"),
    CODE_16831(16831, "钉钉发送文件服务器异常，请稍后再试"),


    CODE_16901(16901, "导入凭证中分录号重复，请确认分录号"),


    //参数类错误
    CODE_17000(17000, "参数错误"),

    //固定资产错误
    CODE_18000(18000, "固定资产操作失败"),
    CODE_18001(18001, "获取一二级类别异常"),
    CODE_18002(18002, "卡片已结账"),
    CODE_18003(18003, "卡片已使用完"),
    CODE_18004(18004, "一级类别名称异常"),
    CODE_18005(18005, "卡片已结账，只允许修改名称，标签，借贷科目，备注"),
    CODE_18006(18006, "获取折旧摊销明细表失败"),
    CODE_18007(18007, "获取折旧摊销余额表失败"),
    CODE_18008(18008, "一级分类下有二级分类，卡片不允许直接在一级分类下"),
    CODE_18009(18009, "一级分类下有卡片，二级分类不允许存在"),
    CODE_18010(18010, "复制卡片数量最多为100张"),
    CODE_18011(18011, "资产类别编码不符合规范"),
    CODE_18012(18012, "资产类别编码不存在"),
    CODE_18020(18020, "卡片每月折旧过低"),
    CODE_18021(18021, "账务处理借方科目代码不存在"),
    CODE_18022(18022, "账务处理贷方科目代码不存在"),


    //session
    CODE_19001(19001, "登陆信息失效,请刷新页面"),

    //权限校验
    CODE_20000(20000, "权限不足"),

    //通知类错误
    CODE_21000(21000, "获取通知信息失败"),
    CODE_21001(21001, "钉钉POST信息无响应"),
    CODE_21002(21002, "钉钉POST信息无效响应"),

    //超级管理员页面错误
    CODE_22000(22000, "公司信息异常，请稍后再试"),
    CODE_22001(22001, "设置管理员异常，请稍后再试"),
    CODE_22002(22002, "公司与账套信息不合法，请刷新页面重试"),
    CODE_22003(22003, "所选增值包已激活"),
    CODE_22004(22004, "增值包信息异常，请稍后再试"),
    CODE_22005(22005, "该增值包还未允许激活，请选择其他增值包激活"),
    CODE_22006(22006, "公司扩展包数量不够，请升级扩展包数"),
    CODE_22007(22007, "所选增值包信息异常，请稍后再试"),
    CODE_22008(22008, "增值包操作异常，请稍后再试"),
    CODE_22009(22009, "该增值包已被激活，不允许试用"),
    CODE_22010(22010, "该增值包已被试用过，不允许再次试用"),
    CODE_22011(22011, "该增值包还未允许试用，请选择其他增值包试用"),
    CODE_22013(22013, "权限不足，需要钉钉管理员权限"),
    CODE_22014(22014, "套餐信息异常，请稍后再试"),
    CODE_22015(22015, "增值包信息异常，请稍后再试"),
    CODE_22016(22016, "订单状态异常，请联系客服"),
    CODE_22017(22017, "取消订单失败，请联系客服"),
    CODE_22018(22018, "发票操作失败，请联系客服"),
    CODE_22019(22019, "贵公司还未购买套餐，请购买套餐后再尝试升级"),
    CODE_22020(22020, "该订单还未支付，不允许退款"),
    CODE_22021(22021, "贵公司还未开通"),


    //TODO 修改充值类错误信息
    //充值类错误
    CODE_30000(30000, "激活帐套错误"),
    CODE_30001(30001, "您还未购买任何套餐"),
    CODE_30002(30002, "剩余激活名额不足，请升级套餐或解除无用激活帐套"),
    CODE_30003(30003, "请不要重复激活帐套"),
    CODE_30004(30004, "请正确选择所需激活帐套"),
    CODE_30005(30005, "套餐信息错误"),
    CODE_30006(30006, "所选帐套还未激活"),
    CODE_30007(30007, "请正确选择所需解除激活帐套"),
    CODE_30008(30008, "当前激活的帐套数目和套餐数目不匹配，请选择正确套餐"),
    CODE_30009(30009, "当前套餐基础包账套数量与公司现有账套数量不符，请重新选择套餐"),

    //阿米巴页面错误
    CODE_23000(23000, "阿米巴操作异常"),
    CODE_23001(23001, "请先前往“辅助核算”－“阿米巴模式”设置需要进行阿米巴核算的辅助类别"),
    CODE_23002(23002, "所选期间超过允许区间，请重新选择"),
    CODE_23003(23003, "辅助类别下必须有损益类科目"),
    CODE_23004(23004, "开通阿米巴辅助核算数量超出套餐量"),
    CODE_23005(23005, "当前账套存在异常数据，请联系管理员"),

    //订单发票类错误,
    CODE_31000(31000, "订单系统错误"),
    CODE_31001(31001, "下单失败，请联系管理员"),
    CODE_31002(31002, "账户充值失败，请联系管理员"),
    CODE_31003(31003, "订单号异常，请联系管理员"),
    CODE_31004(31004, "订单状态异常，请联系管理员"),
    CODE_31005(31005, "请正确选择所需开具发票的订单"),
    CODE_31006(31006, "请选择合法订单"),
    CODE_31007(31007, "发票操作失败，请联系管理员"),
    CODE_31008(31008, "订单还未支付成功，如有疑问请联系客服"),
    CODE_31009(31009, "取消订单失败，请联系客服"),
    CODE_31010(31010, "贵公司当前有其他管理员在下单，请稍后再试"),
    CODE_31011(31011, "贵公司当前有未处理的订单，请稍后再试或联系订单所有者取消"),
    CODE_31012(31012, "该订单不存在"),
    CODE_31013(31013, "该订单不属于贵公司"),
    CODE_31014(31014, "该订单不是您下的订单，请联系下单人"),
    CODE_31015(31015, "订单类型异常，请联系客服"),
    CODE_31016(31016, "需要退款订单还未完成支付，无法完成退款"),

    //支付宝错误
    CODE_32000(32000, "支付宝异常，请联系管理员"),
    CODE_32001(32001, "支付金额异常，请尝试重新支付"),

    //账户到期类错误
    CODE_33001(33001, "当前操作帐套未激活，请先激活"),
    CODE_33002(33002, "当前套餐使用期已到期，请购买套餐"),

    //维护时返回值
    CODE_40000(40000, "超级管理模块正在维护中，我们会尽快恢复服务"),

    CODE_50001(50001, "获得上传文件token失败"),
    //上传附件错误

    CODE_50002(50002, "插入附件错误"),
    CODE_50003(50003, "该凭证下没有附件"),
    CODE_50004(50004, "新增附件地址失败"),
    CODE_50005(50005, "获得附件失败"),
    CODE_50006(50006, "删除附件失败"),
    CODE_50007(50007, "该凭证下没有附件"),;

    private int code;

    private String message;

    public int getCode() {
        return code;
    }

    public String getMessage() {
        return message;
    }

    ReturnEnum(int code, String message) {
        this.code = code;
        this.message = message;

    }

    public static ReturnEnum codeOf(int code) {
        for (ReturnEnum returnEnum : values()) {
            if (returnEnum.getCode() == code) {
                return returnEnum;
            }
        }
        System.out.println("不存在的错误代码: " + code);
        return CODE_00002;
    }
}
